In [1]:
import pandas as pd

In [2]:
methane_1 = pd.read_table('/home/humphs01/Documents/ATU/programming_for_data_analysis_assignment_2/datasets/historic/methane/ch4_annmean_gl.txt', skiprows=45, sep=' ')

In [3]:
methane_1.drop(['#', 'year', 'Unnamed: 3', 'Unnamed: 5', 'mean', 'Unnamed: 7', 'Unnamed: 8', 'Unnamed: 9', 'Unnamed: 10', 'Unnamed: 11', 'unc'], axis=1, inplace=True)

In [4]:
cols = ['year', 'ch4_ppb']

methane_1.columns = cols

In [5]:
methane_1['yr_bp'] = 2023 - methane_1['year']

In [6]:
methane_1 = methane_1.sort_values('year', ascending=False).reindex(columns=['year', 'yr_bp', 'ch4_ppb'])

In [7]:
methane_1

    year  yr_bp  ch4_ppb
38  2022      1  1911.83
37  2021      2  1895.28
36  2020      3  1878.93
35  2019      4  1866.58
34  2018      5  1857.33
33  2017      6  1849.58
32  2016      7  1843.12
31  2015      8  1834.26
30  2014      9  1822.53
29  2013     10  1813.43
28  2012     11  1808.12
27  2011     12  1803.14
26  2010     13  1798.91
25  2009     14  1793.52
24  2008     15  1787.01
23  2007     16  1781.38
22  2006     17  1774.94
21  2005     18  1774.16
20  2004     19  1777.05
19  2003     20  1777.33
18  2002     21  1772.66
17  2001     22  1771.22
16  2000     23  1773.22
15  1999     24  1772.33
14  1998     25  1765.54
13  1997     26  1754.48
12  1996     27  1751.28
11  1995     28  1748.88
10  1994     29  1742.07
9   1993     30  1736.53
8   1992     31  1735.47
7   1991     32  1724.78
6   1990     33  1714.43
5   1989     34  1704.53
4   1988     35  1693.28
3   1987     36  1682.70
2   1986     37  1670.09
1   1985     38  1657.29
0   1984     39  1644.85

In [74]:
methane_2 = pd.read_table('/home/humphs01/Documents/ATU/programming_for_data_analysis_assignment_2/datasets/historic/methane/law_ch4.txt', 
                        sep='\t', skiprows = 647, encoding='unicode_escape', names = ['year', 'ch4_ppb', 'Unnamed: 2', 'Unnamed: 3', 'Unnamed: 4', '64'])

In [75]:
methane_2.drop(['Unnamed: 2', 'Unnamed: 3', 'Unnamed: 4', '64'], axis=1, inplace=True)

In [76]:
methane_2['yr_bp'] = 2023 - methane_2['year']

In [77]:
methane_2.drop(methane_2.index[24:30], axis=0, inplace=True)

In [78]:
methane_2 = methane_2.sort_values('year', ascending=False).reindex(columns=['year', 'yr_bp', 'ch4_ppb'])

In [79]:
methane_2

      year  yr_bp  ch4_ppb
23  1982.0   41.0   1580.9
22  1980.0   43.0   1547.1
21  1978.0   45.0   1514.0
20  1976.0   47.0   1481.5
19  1974.0   49.0   1449.3
18  1972.0   51.0   1417.5
17  1970.0   53.0   1386.0
16  1968.0   55.0   1355.3
15  1966.0   57.0   1326.0
14  1964.0   59.0   1298.4
13  1962.0   61.0   1272.2
12  1960.0   63.0   1247.5
11  1958.0   65.0   1224.2
10  1956.0   67.0   1202.4
9   1954.0   69.0   1182.1
8   1952.0   71.0   1163.8
7   1950.0   73.0   1147.5
6   1948.0   75.0   1133.2
5   1946.0   77.0   1120.6
4   1944.0   79.0   1109.4
3   1942.0   81.0   1099.0
2   1940.0   83.0   1088.9
1   1938.0   85.0   1078.9
0   1936.0   87.0   1068.7

In [158]:
methane_2_5 = pd.read_table('/home/humphs01/Documents/ATU/programming_for_data_analysis_assignment_2/datasets/historic/methane/law_ch4.txt', 
                        sep='\t', skiprows = 155, nrows=15, encoding='unicode_escape', names=['year', 'ch4_ppb', '4', '5', '6', '7'])

In [159]:
methane_2_5.drop(['4', '5', '6', '7'], axis=1, inplace=True)

In [163]:
methane_2_5 = methane_2_5.sort_values('year', ascending=False)

In [164]:
methane_2_5

    year  ch4_ppb
14  1934   1023.2
13  1931   1006.4
12  1928    997.0
10  1926    989.0
11  1926    991.1
9   1917    929.9
8   1914    921.6
5   1907    891.0
6   1907    885.3
7   1907    887.8
4   1901    868.4
3   1900    862.4
2   1894    852.3
1   1893    836.8
0   1888    833.6

In [178]:
methane_3 = pd.read_table('https://www1.ncdc.noaa.gov/pub/data/paleo/icecore/antarctica/epica_domec/edc-ch4-2008.txt', sep = ' ', skipinitialspace=True, skiprows = 155, 
                        names=['depth', 'yr_bp', 'ch4_ppb', '4', '5', '6', '7'])

In [179]:
methane_3.drop(['depth', '4', '5', '6', '7'], axis=1, inplace=True)

In [172]:
methane_3

       yr_bp  ch4_ppb
0         13      907
1        126      784
2        130      762
3        151      710
4        184      727
...      ...      ...
2098  794938      428
2099  796320      418
2100  797277      396
2101  798417      458
2102  799396      399

[2103 rows x 2 columns]

In [180]:
methane_3['year'] = 1950 - methane_3['yr_bp']

In [175]:
methane_3

       yr_bp  ch4_ppb    year
0         13      907    1937
1        126      784    1824
2        130      762    1820
3        151      710    1799
4        184      727    1766
...      ...      ...     ...
2098  794938      428 -792988
2099  796320      418 -794370
2100  797277      396 -795327
2101  798417      458 -796467
2102  799396      399 -797446

[2103 rows x 3 columns]

In [181]:
methane_3 = methane_3.reindex(columns=['year', 'yr_bp', 'ch4_ppb'])

In [182]:
methane_3

        year   yr_bp  ch4_ppb
0       1824     126      784
1       1820     130      762
2       1799     151      710
3       1766     184      727
4       1748     202      696
...      ...     ...      ...
2097 -792988  794938      428
2098 -794370  796320      418
2099 -795327  797277      396
2100 -796467  798417      458
2101 -797446  799396      399

[2102 rows x 3 columns]